<?php

// $arr_one = ['my', 'text', 'text2'];
// $arr_two = ['out', 'some'];
// $unite = $arr_one + $arr_two;

// $arr_one = ['my', 'text'];
// $arr_two = ['out', 'some', 0 => 'text2'];
// $unite = array_merge($arr_one, $arr_two);

// $arr_one = [1, 2];
// $arr_two = [1, 2, 3];

// if ($arr_one != $arr_two) {
// 	echo 'Массивы равны' . "\n";
// } else {
// 	echo 'Массивы не равны' . "\n";
// }

// $arr_one = [1, 2];
// $arr_two = [1, '2'];

// if ($arr_one === $arr_two) {
// 	echo 'array равны' . "\n";
// } else {
// 	echo 'array not equal' . "\n";
// }

// $arr_one = [1, 2, 3, 4];

// for ($i = 0; $i < 6; $i++) {
// 	echo isset($arr_one[$i])
// 		? 'Element $arr_one[' . "$i" . '] exist' . "\n" . isset($arr_one[$i]) . "\n\n"
// 		: 'Element $arr_one[' . "$i" . '] not exist' . "\n" . isset($arr_one[$i]) . "\n\n";
// }

// ! что я узнал
/*
arr + arr оператор + позволяет слиять две массивы. Но есть некоторые особености такие как:
при слиянии значение индекста 1 с значением инбекса 2 произойдет перетерка и доминатом будет первый массив 
array_merge() = функция пзволяет слиять две сначение. При слиянии аргументы после первого массива начинают
в конце массива добовляется
isset() - функция - принимает один оргумент и выдает ture (доесть 1) если элемент создежит значение и
false (тоесть (пустота)) если элемент не содержит значение
is_array() - принимает один аргумент, возврашает true если значение ялвяется массивом false если не является
in_array() - функция ишет значение в внутри массива, принимает три аргумента, первое значение которое нужно найти
второе массива и третий аргумет true or false которые указывает тип сравнения строгое или не сторогое сравнение 
array_key_exists() - тоже самое что in_array только ишет индекс
unset() - функция удаляет элемент;
*/

$arr_one = [1, 2, 3, 4, 5];

echo array_key_exists(2, $arr_one) . "\n";